cases/catalyticPimpleFOAM_v0.9/Case-01/constant/solverOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.3;
    format      binary;
    class       dictionary;
    location    "constant";
    object      solverOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    energyEquation   on; 

    homogeneousReactions off;

    heterogeneousReactions on;

    inertSpecie N2;

    kineticsFolder       "../../../cases/KineticMechanisms/MethaneOnRhodiumUBI/MethaneOnRhodiumUBI";

    spark off;

    alfaCatalyst 1500.0;

    massFractionsTolerance 1.e-9;

    diffusivityCorrection "semi-implicit";
    massDiffusionContributionInEnergyEquation on;

    strangAlgorithm "TransportReactionMomentum";

    relativeTolerance 1.2e-05;
    absoluteTolerance 1.0e-10;
    
    radiativeHeatTransfer   off;
    environmentTemperature 300.;
    

// ************************************************************************* //


